
do

local function run(msg, matches)
local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'حمايه' then
local S = [[  
قنــــاة ســــورس KEEPER الجديـد
   💋 @DEV_KEEPER_NEW 💋   
➖➖➖➖➖➖➖➖➖➖➖
🔺الاوامـر الخاصه|⭕️| بحماية المجموعـةة🔺
________________________
تستخدم |🔥|{قــفل / فتــح}|🔥|في 
المجموعــــه❗️
________________________
|🔴| الــروابـــــــــــط 
|🔴| التـــوجيــــــــــه
|🔴| الدردشـــــــــــــه
|🔴| جهــاة الاتصـــــــال
|🔴| اللغـه العربيــــــه
|🔴| الاضـــافـــــــــــه
|🔴| الــصـــــــــــــور
|🔴| الصـور المتحركـــــه
|🔴| الــوسائـــــــــــط
|🔴| الــبوتـــــــــــات
|🔴| الاضافــه الجماعـيــه
|🔴| الفــايـــــــــــلات
|🔴| الـتكــــــــــــرار
|🔴| الفــــيديـــــــــو
|🔴| الـــــصــــــــــوت
|🔴| المـــجموعـــــــــه
➖➖➖➖➖➖➖➖➖➖➖
تم صنع الســورس بواســطةة المطوريــن
          🔶#القيــصر كرار + غيــث🔶
🌀➖{ @llX8Xll }
🌀➖{ @l1lxl1l }           
              بوت تواصــل المحظوريــن
🌀➖{ @lZlxlZlBOT }              
                     قناة الســــورس
🌀➖{ @DEV_KEEPER_NEW } 

]]
reply_msg(reply_id, S, ok_cb, false) 
end

if not is_momod(msg) then
local S = "  للمشرفــــٰين 🕵🏻 فقـــط عزيــزي♥️❗️ "
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(حمايه)$",
},
run = run 
}
end