
do

local function run(msg, matches)
local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'مساعده' then
local S = [[  
 قنــــاة ســــورس KEEPER الجديـد
   💋 @DEV_KEEPER_NEW 💋   
➖➖➖➖➖➖➖➖➖➖➖
🔺الاوامـــــر الخاصه|⭕️| بالمطــــور🔺
________________________
|🔴| تفعيــل |=| لتفعيــل  البوت فــي المجموعــــــةة❗️
|🔴| تعطيــل |=| لتعطـــل البوت  فــي المجموعــــــةة❗️
|🔴| تحديـث |=| لتحديــث السيرفر  ❗️
|🔴| رفع المديــر |=| لرفـع المدير فــي 
المجموعــــــةة❗️
|🔴| الملفات |=| لاضهار ملفـــات البـوت❗️
|🔴| اضف مطور |=| الاضافه مطور في البوت
|🔴| تفعيل ملف + اسم الملف |=| لتفعيـــل الملف في البــوت❗️
|🔴| تعطيل ملف + اسم الملف |=| لتعطيـل الملـف في البـوت ❗️
|🔴| الردود |=| لاضــهار الردود❗️
|🔴| رداضف + الاسم  |=| لاضـــافة رد في الــبوت❗️
|🔴| رد حذف + الاسم |=| لحذف الرد  من البـــوت❗️
|🔴| غــادر |=| لخروج البوت من المجموعــــــةة❗️
➖➖➖➖➖➖➖➖➖➖➖
تم صنع الســورس بواســطةة المطوريــن
          🔶#القيــصر كرار + غيــث🔶
🌀➖{ @llX8Xll }
🌀➖{ @l1lxl1l }           
              بوت تواصــل المحظوريــن
🌀➖{ @lZlxlZlBOT }              
                     قناة الســــورس
🌀➖{ @DEV_KEEPER_NEW } 

]]
reply_msg(reply_id, S, ok_cb, false) 
end

if not is_momod(msg) then
local S = "  للمشرفــــٰين 🕵🏻 فقـــط عزيــزي♥️❗️ "
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(مساعده)$",
},
run = run 
}
end