do 

function run(msg, matches) 
  return [[ 
   قنــــاة ســــورس KEEPER الجديــد
   💋 @DEV_KEEPER_NEW 💋   
➖➖➖➖➖➖➖➖➖➖➖
تــــوجد ثــلاث |🔥| اوامـــر |⭕️| وهــي كـالتالــي:👇🏾💋
_________________________
|🔴| اداره |=| لإضهار الاوامر المتعلقـة بأدارة المجموعـــــةة❗️
|🔴| حمايـه |=| لغرض اضهار اوامر حمايـــة المجموعــــةة❗️
|🔴| مساعـده |=| لاضهـار الإوامر الخاصــه بالمطــــــور❗️
➖➖➖➖➖➖➖➖➖➖➖
تم صنع الســورس بواســطةة المطوريــن
          🔶#القيــصر كرار + غيــث🔶
🌀➖{ @llX8Xll }
🌀➖{ @l1lxl1l }           
              بوت تواصــل المحظوريــن
🌀➖{ @lZlxlZlBOT }              
                     قناة الســــورس
🌀➖{ @DEV_KEEPER_NEW }             

]] 

end 

return { 
description = "Help list", 
usage = "Help list", 
patterns = { 
"^(الاوامر)$", 
"^(الاوامر)$",
}, 
run = run 
} 
end