
do

local function run(msg, matches)
local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'اداره' then
local S = [[  
قنــــاة ســــورس KEEPER الجديـد
   |💋| @DEV_KEEPER_NEW |💋|   
➖➖➖➖➖➖➖➖➖➖➖
🔺الاوامـــــر الخاصه|⭕️| بالإداره🔺
#ملاحظه الاوامر تستخدم بالرد او بالمعرف❗️
________________________
|🔴| حظر |=| لحظر العضــو من المجموعـــــــةة❗️
|🔴| الغاء الحظر |=| لألغاء الحضــر عن العضــــو❗️
|🔴| حظر عام |=| لحظر العضـو من كل مجموعات البـوت❗️
|🔴| الغاء العام |=| لإلغاء الحظــر العام عن العـضو❗️
|🔴| كتم |=| لكتم العضـــو في المجموعـــــةة❗️
|🔴| كتم |=| لإلغــاء كتم العضــو في المجموعـــــةة❗️
|🔴| الاعدادات |=| لعرض اعدادات المجموعـــــةة❗️ 
|🔴| رفع ادمن |=| لرفع العضـو ادمن في الـبوت❗️
|🔴| تنزيل ادمن |=| لتزيل العضو من الاداره في البـوت❗️
|🔴| معلوماتي |=| لعرض معلومات العضو داخل المجموعــــةة❗️
|🔴| موقعي |=| لعرض موقعـــك في المجموعــــــةة❗️
|🔴| ايدي |=| لعرض ايدي  العضو في المجموعــــةة❗️
|🔴| الادمنيه |=| لعرض الادمنيـــة في البــوت ❗️
|🔴| ضع رابـط |=| لحفـــــظ الرابط  فـي المجموعـــــةة❗️
|🔴| الرابط |=| لعرض رابط المجموعـــة❗️
|🔴| ضع مذكره |=| لحفظ  مذكره في البوت❗️
|🔴| مذكرتي |=| لاضهاء المذكره المحفوضــــةة❗️
➖➖➖➖➖➖➖➖➖➖➖
تم صنع الســورس بواســطةة المطوريــن
          🔶#القيــصر كرار + غيــث🔶
🌀➖{ @llX8Xll }
🌀➖{ @l1lxl1l }           
              بوت تواصــل المحظوريــن
🌀➖{ @lZlxlZlBOT }              
                     قناة الســــورس
🌀➖{ @DEV_KEEPER_NEW } 



]]
reply_msg(reply_id, S, ok_cb, false) 
end

if not is_momod(msg) then
local S = "  للمشرفــــٰين 🕵🏻 فقـــط عزيــزي♥️❗️ "
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(اداره)$",
},
run = run 
}
end