-- made by { @llX8Xll } 
do
ws = {}
rs = {}

-- some examples of how to use this :3 
ws[1] = "السلام عليكم"
rs[1] = "وُعَ ـلَيّكَمِـ آلَسًـلَآمِـ 😻"

ws[2] = "سلام عليكم"
rs[2] = "وُعَ ـلَيّكَمِـ آلَسًـلَآمِـ 💋"

ws[3] = "هلو"
rs[3] = "هِلَوُآتُ حً ـيّآتُيّ🌚🍷"

ws[4] = "هلاو"
rs[4] = "هِلَوُآتُ حً ـيّآتُيّ🌚🍷"

ws[5] = "مرحبا"
rs[5] = "مِـرَآحً ـبّـ🙆🏽"

ws[6] = "شلونكم"
rs[6] = "تُمِـآمِـ وُآنٌتُ💁🏼"

ws[7] = "شلونك"
rs[7] = "تُمِـآمِـ وُآنٌتُ🤷🏾‍♀️"

ws[8] = "شلونج"
rs[8] = "تُمِـآمِـ وُآنٌتُ🙆🏽"

ws[9] = "شخبارك"
rs[9] = "آلَحً ـمِـدُ لَلَهِ وُآنٌتُ👩🏾‍🌾"

ws[10] = "شخبارج"
rs[10] = "آلَحً ـمِـدُ لَلَهِ وُآنٌتُ👱🏾‍♀️"

ws[11] = "شخباركم"
rs[11] = "آلَحً ـمِـدُ لَلَهِ وُآنٌتُ💋"

ws[12] = "كيفكم"
rs[12] = "آمِـنٌآحً ـ وُآنٌتُ👻"

ws[13] = "شكو ماكو"
rs[13] = "غّ ـيّرَكَ بّـآلَكَلَبّـ مِـآكَوُ😺"

ws[14] = "سؤال"
rs[14] = "جوابٌِ😽"

ws[15] = "سوال"
rs[15] = "جوابٌْ 😼"

ws[16] = "فدوه"
rs[16] = " فُدُآكَ آلَكَوُنٌ ⭕️ وُمِـآيّ آلَعَ ـيّوُنٌ 🔥عَ ـزَيّزَيّ😘💋"

ws[17] = "فديتك"
rs[17] = "فہدآكہ هہذآ 👈🏾❤️"

ws[18] = "فديتج"
rs[18] = "آحہمہ آحہمہ آشہمہ ريہحہهہ زحہفہ🙄😼☝🏽"

ws[19] = "بوت"
rs[19] = "آنت شـدكول |🔥| آي بــوت ع ـآبــت هآلخ ـلقه🌚🙌 وبــلت كول شـويه 😺يصـيـح  بــوت وج ـه آلبــومـه😼😻☝🏽"

ws[20] = "غني"
rs[20] = "شّكـلَوُلَكَ عَ ـنٌيّ كَآوُلَيّ وُجَ ـهِ آلَتُنٌكَهِ😸🤡☝🏽"

ws[21] = "غنيلي"
rs[21] = "خٌآيـﮯبّ گمِـ  تُآلَيـﮯ وُگتُيـﮯ😼 آغّنيـﮯ وُآلَلَهِہ‏‏ يـﮯآ آلَلَهِہ‏‏ نآسًـ لَآ صِـلَآهِہ‏‏ وُلَآ تُعَلَآ 👈🏾🍾🍷وتُريـﮯدُنيـﮯ آنحرفُ مِـثًلَهِہ‏‏مِـ آسًـتُغّفُر آلَلَهِہ‏‏ 😌😹☝🏽"

ws[22] = "غازلني"
rs[22] = "راح اُحـــط شِفتـِــي 💋 علـٌِ شفتٌِــك 💋 وشُُـــبَع ْ من الـ شفِـفهٌ  ضُوگ😋 راحُ اجرٰبيه عٰ لـ كيفّـي 🙀 والا  اخلــي الُجوُه فوٰگ 😹😻☝️"

ws[23] = "تخليني"
rs[23] = "اٌيــــُـــــي حبيْ اخُــــليكْ عْـــِلوااا 😔 اليْوم تعْبــانْ انيَ ٌهـٰٰـٰـٰـــاكْ 🐑🐏🐑🐄🐄 اسُْــــرح بيهنْ بــسٰ ديــرْ بالكْ عليِـــ💋ــهن فدِوه موْ تصْير اْثولَ 🙊وتيــهْم😻😹😹☝️"

ws[24] = "مطورك"
rs[24] = "هذا مطوري @llX8Xll"

ws[25] = "السورس"
rs[25] = "سورس KEEPER"

ws[26] = "هذا يا سورس"
rs[26] = "سورس كوكي وغيث الضلع سورس KEEPER"

ws[27] = "اريد بوت"
rs[27] = "تعال هنا @llX8Xllbot"

ws[28] = "اريد قناه"
rs[28] = "تعٌِالً هناًْ @xx_KR_HM_xx وهْنُـْا @DEV_KEEPER_NEW 💋"

ws[29] = "قناه"
rs[29] = "@xx_KR_HM_xx 💋 @DEV_KEEPER_NEW"

ws[30] = "اريد قناة"
rs[30] = "@xx_KR_HM_xx 💋 @DEV_KEEPER_NEW 💋"

ws[31] = "منور"
rs[31] = "بّـنٌوُرَ عَ ـيّوُنٌكَ آلَحً ـلَوُيّنٌ😻"

ws[32] = "هذا بوت"
rs[32] = "آنٌےـتُےـ شّےـتُےـكےـوُلَ آبّےـنٌےـيّےـ🐴👈🏾☝🏽"

ws[33] = "شسم البوت"
rs[33] = "كـِـٰٰـيـبـٌٰر 🌚🍷"

ws[34] = "شسمك"
rs[34] = "إسِــٰميِْ كيُْـــبرْ 🍾🍷"

ws[35] = "😍"
rs[35] = "فہديہتہ هہآلعہيہؤنہ آلحہلؤيہنہ😽🍷"

ws[36] = "😍😍"
rs[36] = "صہعہد آلحہبہ يہمہهہ فہدؤؤهہ💋"

ws[37] = "😂"
rs[37] = "دُوُمِـ هِآلَضـحً ـكَهِ عَ ـيّوُنٌيّ🌚🍷☝🏽"

ws[38] = "😂😂"
rs[38] = "دُوُوُمِـ آلَضـحً ـكَهِ حً ـيّآتُيّ☺️☝🏽"

ws[39] = "😂😂😂"
rs[39] = "لآ تہضہحہكہ هہؤآيہ بہطہل بہطہل لتہصہيہر هہيہلكہ😒😹😹☝🏽"

ws[40] = "😹😹"
rs[40] = "دُوُوُمِـ آلَضـحً ـكَهِ حً ـيّآتُيّ😻☝🏽"

ws[41] = "😉"
rs[41] = "آؤيہليہ بہآعہ آلغہمہزهہ تہصہطہر صہطہر🙊🍷"

ws[42] = "😉😉"
rs[42] = "آؤيہليہ بہآعہ آلغہمہزهہ تہصہطہر صہطہر😻😻☝🏽"

ws[43] = "🙊"
rs[43] = "ضہمہ حہلكہهہ لآنہ يہشہبہهہ حہلكہ آلزرآفہهہ😂🙆🏽"

ws[44] = "😊"
rs[44] = "آبہتہسہآمہتہكہ فہيہهہآآ آلفہ حہكہآيہهہ فہيہ دآخہلكہ ؤآلفہ جہرحہ فہيہ قہلبہكہآللهہ يہسہآعہدكہ مہآيہ عہيہنہيہ☺️😻🌚🍷☝🏽"

ws[45] = "☺️☺️"
rs[45] = "فــٰٰــــٰـديتْ الخجِّول😽🙆🏽"

ws[46] = "🚶"
rs[46] = "بہآعہ آلهہيہبہهہ تہسہطہر💋🙆🏽🍷"

ws[47] = "😳"
rs[47] = "ليہشہ مہصہدؤمہ حہبہيہ شہنہؤ جہديہدهہ عہليہكہ😻🍷"

ws[48] = "😳😳"
rs[48] = "ليہشہ مہصہدؤمہ حہبہيہ شہنہؤ جہديہدهہ عہليہكہ😻🙆🏽"

ws[49] = "😱😱😱"
rs[49] = "خٌ ـيّرَ يّآرَبّـيّ 😱 شـكَوُ لَيّشّـ مِـتُفُآجَ ـئ🙄😳🍷"

ws[50] = "😱"
rs[50] = "خٌ ـيّرَ يّآرَبّـيّ 😱 شـكَوُ لَيّشّـ مِـتُفُآجَ ـئ🙄😳🍷"

ws[51] = "😌"
rs[51] = "فہديہتہ آلريہلآكہسہ حہبہيہبہيہ🌚🍷"

ws[52] = "😌😌"
rs[52] = "فہديہتہ آلريہلآكہسہ حہبہيہبہيہ🌚🍷"

ws[53] = "😏"
rs[53] = "شہبہيہ حہلكہكہ لآزمہ ضہآربہكہ شہرجہيہ 😒🍷☝🏽"

ws[54] = "😏😏"
rs[54] = "شہبہيہ حہلكہكہ لآزمہ ضہآربہكہ شہرجہيہ 🌚🍷"

ws[55] = "💋"
rs[55] = "💋🌚🍷"

ws[56] = "😘"
rs[56] = "عہزيہزيہ مہمہنہؤعہ (💋آلبہؤسہهہ💋) هہنہآ بہسہبہبہ آلحہدآيہقہ 🙊 آلذيہنہ يہكہسہرؤنہ آلخہآطہر😢 لآ تہكہرر هہذآ آلآمہر رجہآظً😻😹😹☝🏽"

ws[57] = "😘😘"
rs[57] = "عہزيہزيہ مہمہنہؤعہ (💋آلبہؤسہهہ💋) هہنہآ بہسہبہبہ آلحہدآيہقہ 🙊 آلذيہنہ يہكہسہرؤنہ آلخہآطہر😢 لآ تہكہرر هہذآ آلآمہر رجہآظً😻😹😹"

ws[58] = "😘😘😘"
rs[58] = "فُدُيّتُ آلَبّـوُسًـهِ يّمِـهِ عَ ـسًـلَ عَ ـسًـلَ 💋😋😻"

ws[59] = "💔"
rs[59] = "كہلبہهہ مہكہسہؤر خہطہيہهہ تہريہد آخہيہطہهہ آلكہ 💉🍷🌚☝🏽"

ws[60] = "😑😑"
rs[60] = "عہيہؤنہكہ ؤيہنہ😳🙄  جہآريہ آلتہحہديہثہ تہمہ آلطہمہسہ😻🍷😂"

ws[61] = "😑"
rs[61] = "عہيہؤنہكہ ؤيہنہ😳🙄  جہآريہ آلتہحہديہثہ تہمہ آلطہمہسہ😻🍷😂"

ws[62] = "😔"
rs[62] = "ليہشہ ضہآيہجہ 😔 يہرؤحہيہ تہعہآل شہكہيہليہ هہمہؤمہكہ😻🍷"

ws[63] = "😔😔"
rs[63] = "ليہشہ ضہآيہجہ يہرؤحہيہ تہعہآل شہكہيہليہ هہمہؤمہكہ☺️😻"

ws[64] = "😔😔😔"
rs[64] = "ليہشہ ضہآيہجہ يہرؤحہيہ تہعہآل شہكہيہليہ هہمہؤمہكہ🍷🍷😻"

ws[65] = "😬"
rs[65] = "فہديہتہ هہآلسہنہؤنہ آلصہفہر آلمہزنہجہرآتہ كہبہر مہآ تہضہمہهہنہ فہظہحہتہنہهہ🤔😹😹"

ws[66] = "😁"
rs[66] = "فہديہتہ هہآلسہنہؤنہ آلصہفہر آلمہزنہجہرآتہ كہبہر مہآ تہضہمہهہنہ فہظہحہتہنہهہ🙊😻😹"

ws[67] = "😎"
rs[67] = "عَ ـوُدُ شّـوُفُوُنٌيّ آنٌيّ شّـخٌ ـصِـيّهِ قَوُيّهِ وُهِوُ جَ ـنٌهِ وُآحً ـدُ آلَغّ ـرَآبّـ آلَعَ ـطٌـشّـآنٌ😒😹🍷"

ws[68] = "😎😎"
rs[68] = "عَ ـوُدُ شّـوُفُوُنٌيّ آنٌيّ شّـخٌ ـصِـيّهِ قَوُيّهِ وُهِوُ جَ ـنٌهِ وُآحً ـدُ آلَغّ ـرَآبّـ آلَعَ ـطٌـشّـآنٌ🌚🍷"

ws[69] = "😋😋"
rs[69] = "كہبہر مہطہلعہ آلسہآنہهہ تہكہؤلكہ ؤآحہد خہبہل 😂💋🙆🏽"

ws[70] = "😋"
rs[70] = "كہبہر مہطہلعہ آلسہآنہهہ تہكہؤلكہ ؤآحہد خہبہل 😂💋🙆🏽"

ws[71] = "😭"
rs[71] = "ليہشہ تہبہجہيہ يہرؤحہيہ هہآكہ كہلنہسہ🤧😻"

ws[72] = "😭😭"
rs[72] = "ليہشہ تہبہجہيہ يہرؤحہيہ هہآكہ كہلنہسہ🤧🍷"

ws[73] = "😭😭😭"
rs[73] = "كہسہرتہ كہلبہيہ  خہطہيہهہ🙁"

ws[74] = "😪"
rs[74] = "لازم منشول الحلوو😉😂"

ws[75] = "😢"
rs[75] = "لَآ تُزَعَ ـلَ  يّعَ ـمِـرَيّ مِـتُسًـوُى😌"

ws[76] = "🙄"
rs[76] = "شہبہيہكہ آنہحہؤلتہ ؤجہهہ آلطہآؤهہ🌚🍷"

ws[77] = "🙄🙄🙄"
rs[77] = "شہبہيہكہ آنہحہؤلتہ ؤجہهہ آلطہآؤهہ🍷😻"

ws[78] = "🙄🙄"
rs[78] = "شہبہيہكہ آنہحہؤلتہ ؤجہهہ آلطہآؤهہ🙆🏽🌚🍷"

ws[79] = "😡😡"
rs[79] = "طہمہآطہهہ حہمہرهہ 😻😹😹"

ws[80] = "😡"
rs[80] = "عَ ـوُدُ ضـآجَ ـ تُهِيّ بّـهِيّ عَ ـمِـيّ عَ ـلَ كَيّفُكَ يّمِـيّسًـيّ🌚🍷"

ws[81] = "همسه"
rs[81] = "••• اوُٓيٌــلــيْ لكُٰ هاُي تٰٰــــاُجْ 👑 وعِــلٰم شُحٰــدهٰ الــيندٰگ بيٰهه•••😍😻☝️"

ws[82] = "غيث"
rs[82] = "فديت ربه هذا الضلع ❤️💋"

ws[83] = "كوكي"
rs[83] = "هﮧذآ 🚶 آلﮧذيﮧبﮧ عﮧمﮧيﮧ مﮧنﮧو يﮧلﮧحﮧكﮧهﮧ 💋💋🍷"

ws[84] = "فقار"
rs[84] = "هذٌا ضْلـــع كُِوٌكــٰــي فدٍيتْه😻☝️"

ws[85] = "حوراء"
rs[85] = "صہآكہهہ آلكہرؤبہ فہديہتہ آسہمہهہ😍😻🍷"

ws[86] = "نور"
rs[86] = "اوٌيليْ لك ٌ ضحٌكتهٌ تسوْه الدنٌيا وٌما ُبيههّ😻☝️"

ws[87] = "فطم"
rs[87] = "صہؤتہهہ صہفہآتہهہ 🙊ضہحہكہتہهہ آحہل شہيہ بہآلدنہيہآ😻"

ws[88] = "مريم"
rs[88] = "فُدُيـﮯتُهِہ‏‏ هِہ‏‏آيـﮯ شّـمِـعَهِہ‏‏ 🌟آلَگروُبّ بّدُوُنهِہ‏‏ آلَگروُبّ مِـضـلَمِـ😻"

ws[89] = "عسل"
rs[89] = "لكہ هہآيہ آدمہؤنہهہ 😌 آلكہرؤبہ فہديہتہ آسہمہهہ آدعہؤلهہ بہآلنہجہآحہ فہدؤؤهہ😻"

ws[90] = "اغنيه كوكي"
rs[90] = "#مشــﮩـتاقلـُﮩـك مــﮩـوت مشــﮩـتاقلـُﮩـك لعــيـونك مشــﮩـتاقلـُﮩـك مــﮩـوت وخـايف امـوت و خـاف مـااشـوفـك حـبيـبي مشــﮩـتاقلـُﮩـك مــﮩـوت لـﮩـو تـﮩـشـوف حــبيبــﮩـي صــﮩـار بيــﮩـةة و اللـه تبــﮩـجـي دم علــﮩـۑـةة.  مشــﮩـتاقلـُﮩـك انــي احــس نـار بصــدري و لــو شــوفتك انــي انــطي عمــري و ارحـم. حبيـبيك فــدوه انــظــر بعـمري مشــﮩـتاقلـُﮩـك انتـتمنه اكـون بحـضـنك و اتمنــةة ابـوسك واشـتم ريحـةة عـطرك مــو راح امــوت مشــﮩـتاقلـُﮩـك مــﮩـوت 😔😔"

ws[91] = "باي"
rs[91] = "الله وياك تاج مخي🌝🌟"

ws[92] = "جاو"
rs[92] = "ج ـآوآت بــح ـي🌚"

ws[93] = "اكلك"
rs[93] = "گوُلَيـﮯ  وُمِـآ گوُلَ🙊"

ws[94] = "تحبني"
rs[94] = "آعہشہقہكہ  آذؤبہ بہيہكہ يہآحہلآليہ 💋🙊"

ws[95] = "بوسه"
rs[95] = "امُـــٰــــــ💋💋💋💋ـــ ـــُـُُـــ😘😘😘ـ ـ ـح بعد شتريد😌😉😍"

ws[96] = "بوسه جبيره"
rs[96] = "لآ مہآكہؤ آخہآفہ عہليہ ؤليہديہ 🌚🍷😂😂"

ws[97] = "بوسني"
rs[97] = "امووووواح💋🌚🍷"

ws[98] = "ممكن هلاو"
rs[98] = "هہلآؤآتہ عہيہنہآيہ"

ws[99] = "كفو"
rs[99] = "كہفہؤؤ مہنہكہ آنہتہ عہيہؤنہيہ😻"

ws[100] = "الديوانيه"
rs[100] = "آجہمہل نہآسہ ؤآحہلهہ مہحہآفہظہهہ فہديہتہهہ🙊 بہيہهہ مہطہؤريہ😻🍷"

ws[101] = "شكد عمرك"
rs[101] = "آثہكہل شہؤيہهہ لتہزحہفہ عہيہؤنہيہ🙆🏽🌚🍷"

ws[102] = "شكد عمرج"
rs[102] = "آثہكہل شہؤيہهہ لتہزحہفہ عہيہؤنہيہ🌚😹"

ws[103] = "خاص"
rs[103] = "آيہ عہمہيہ خہآصہ ؤآنہيہ هہنہآ مہحہد آليہهہ😔 مہآحہبہكہمہ🙁😒🍷"

ws[104] = "اجيت"
rs[104] = "نہؤرتہ آلمہجہمہؤعہهہ عہزيہزيہ💋🌚"

ws[105] = "😻😻"
rs[105] = "يمه الحب يمه 🙊"

ws[106] = "🌚"
rs[106] = "مہآ تہسہبہحہ شہبہيہكہ ؤصہخہ 😹😹"

ws[107] = "🌝"
rs[107] = "منﮩﮩﮩﮩور🌝🦀"

ws[108] = "🌚🌝"
rs[108] = "بيك انفصام بالشخصيه😹🙊"

ws[109] = "🙈🙈"
rs[109] = "فہديہتہ آلخہجہؤل 😉"

ws[110] = "تكرهني"
rs[110] = ".. #الله_شاهد🙏 #والله احب الناس #كلهه ...😌🍃 وابد ماكارهلي واحد ...😐🍃#الا_اكلكم ...😞🍃🍁حتى احب الكارهيني ...😐🍃🍂 #الا_اكلكم #هسه_مشتاگ انه_المن !!!🍂😶 #والله مشتاك لجماعه ... مزاعلينٌِيْ🍁😑ولّــو كٌـُلة #مصلحجيه 🚶😿نعلعلاااا والديُْـهم😸😹😹👌"

ws[111] = "شكد"
rs[111] = "بہكہد آلدنہيہآ هہآيہ😻💋"

ws[112] = "احبك"
rs[112] = "آمہؤتہ بہيہكہ عہزيہزيہ😌😘"

ws[113] = "."
rs[113] = "لا دز رابط تره انعل والديك😒🍷"

ws[114] = "اقرالي دعاء"
rs[114] = "دعہآء آلتہلمہيہذ 😹👈🏾٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠آدعہؤكہ يہآ آلآهہيہ يہآؤآسہعہ آلعہطہآيہ يہسہر 😌عہليہهہ درسہيہ بہآلجہد ؤآلذكہآيہ ؤحہفہظہ 🚶 آبہيہ ؤآمہيہ ؤكہليہ آصہقہآيہ لحہد يہصہفہكہ شہكہرآ شہكہرآ😹😹😻"

ws[115] = "اريد شعر"
rs[115] = "شتحب اسمعك حزين 😔 لو رمانسي😻😉"

ws[116] = "حزين"
rs[116] = "رؤحہ لليہؤتہيہؤبہ🙊 ؤكہتہبہ شہعہر حہزيہنہ ؤيہطہلعہلكہ😹😹"

ws[117] = "رومانسي"
rs[117] = "عہيہؤنہيہ تہعہذرنہيہ 😍 مہمہكہبہل آنہيہ حہتہ آنہطہيہكہ شہعہر رمہآنہسہيہ😹😻"

ws[118] = "اني"
rs[118] = "آنہتہ لؤ بہسہ تہنہجہبہ ؤتہسہكہتہ آمہؤريہ كہؤلهہ تہمہآمہ😹😘"

ws[119] = "اسكت"
rs[119] = "لا بربك اسكت انت حبي😪"

ws[120] = "كافي"
rs[120] = "اوك سكتت🤐🤐"

ws[121] = "ضوجه"
rs[121] = "ؤآلمہطہلؤبہ ☹️😹"

ws[122] = "شغال"
rs[122] = "اكيد حيُــــــــ💋💋💋ـــــاتي"

ws[123] = "اتفل"
rs[123] = "خخـ﴿😚﴾ـخ تـ﴿💦﴾ـفوو خخـ﴿😚﴾ـخ تـ﴿💦﴾ـفوو خہــ💦ــخــ💦ـــــہٰٰخ تٌـٌـٌـٌ﴿💦﴾ـٌـٌـٌـٌف✟خــ😚ــخــ😚ـخ تــ💦ــفــ💦ــوو خخخخــووــووــووــوو💦💨😚تفــووــو😹😹"

ws[124] = "جوعان"
rs[124] = "روح اكل عيوني😍"

ws[125] = "حيدر"
rs[125] = "صــٰٰــٰـــِـاكٍ الكُـ ـ 💋💋ــــروبٌْ فديتــهً🙊💋🍷"

ws[126] = "الاصدار"
rs[126] = "لا تلعب حبي😑"

ws[127] = "سحك"
rs[127] = "ح ـبــيبــي  آذآ مـرآمـ وسـآره وح ـورآء🙊 هنآ آع ـتبــر نفسـك آنفضـح ـت بــ٩٩ 😹كروبــ آح ـسـن ح ـل غ ـآدر آلكروبــ ح ـت مـآ يفشـلنك😹😻🍷"

ws[128] = "وجع"
rs[128] = "يــــٰٰـٰٓـٰٓـٰٓـٓــٰـنــــٰٰـٰٓـٰٓـٰٓـٓــٰـامًً بـৡﮩـہٌَـكـًًلـبـৡﮩـہٌَـك🌚🍷"
ws[129] = "اشعر"
rs[129] = "حہبہيہتہهہ ☺️ ؤآرد آفہتہهہمہ نہيہتہكہمہ ؤيہآهہآ شہنہؤ 😕ؤبہآلآصہحہ آنہتہؤ مہنہؤ 🙁 بہآنہيہلهہ بہريہتہيہ نہفہسہ 😻خہآفہنہ عہكہدتہؤهہ بہمہهہر😊 تہرهہ عہآكہد كہصہيہبہهہ بہرآسہهہ😘🍷 "
-- the main function
function run( msg, matches ) 
   -- just a local variables that i used in my algorithm 
   local i = 0; local w = false 

   -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
   -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
   for k,v in pairs(ws) do 
      -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
      if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
         -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
         i = k; w = true; 
      end 
   end 

   -- check if { w } is not false and { i } not equals to 0 
   if ( (w ~= false) and (i ~= 0) ) then 
      -- get the receiver :3 
      R = get_receiver(msg) 
      -- send him the proper message from the index that { i } assigned to 
      --send_large_msg ( R , rs[i] ); 
      --send_reply(msg.id, rs[i]) 
      reply_msg(msg.id, rs[i], ok_cb, false ) 
   end 
   -- don't edit this section 
   if ( msg.text == "about" ) then 
      if ( msg.from.username == "li_xXx_il" ) then 
         R = get_receiver(msg) 
         send_large_msg ( R , "Made by @li_xXx_il" ); 
      end 
   end 

end 

return { 
   patterns = { 
      "(.*)" 
     }, 
     run = run 
} 

end
